Python

In [6]:
## Question 1 : fibonacci sequence

In [9]:
def fibonacci(n):
    if n <= 0:
        return []
    elif n == 1:
        return [0]
    elif n == 2:
        return [0, 1]
    
    fibo_seq = [0, 1]
    for i in range(2, n):
        next_num = fibo_seq[-1] + fibo_seq[-2]
        fibo_seq.append(next_num)
    
    return fibo_seq

In [10]:
## Question 2 : is_prime

In [11]:
def is_prime(num):
    if num <= 1:
        return False
    if num == 2:
        return True
    if num % 2 == 0:
        return False
    
    for i in range(3, int(num**0.5) + 1, 2): # check if num will be divisible by i
        if num % i == 0:
            return False
    
    return True

Pandas

In [13]:
import pandas as pd

In [14]:
data = {
'Date': ['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04', '2024-01-05'], 'Sales': [200, 220, 210, 215, 225],
'Region': ['North', 'South', 'East', 'West', 'North'],
'Manager': ['John', 'Jane', 'Joe', 'Jake', 'John']
}
df = pd.DataFrame(data)

In [15]:
# 1.Load the dataset into a pandas DataFrame and display its first 5 rows.

In [16]:
df.head()

         Date  Sales Region Manager
0  2024-01-01    200  North    John
1  2024-01-02    220  South    Jane
2  2024-01-03    210   East     Joe
3  2024-01-04    215   West    Jake
4  2024-01-05    225  North    John

In [17]:
# 2. Add a new column `Profit` which is 10% of the `Sales` column.

In [19]:
df['Profit']= df['Sales']*0.1
df

         Date  Sales Region Manager  Profit
0  2024-01-01    200  North    John    20.0
1  2024-01-02    220  South    Jane    22.0
2  2024-01-03    210   East     Joe    21.0
3  2024-01-04    215   West    Jake    21.5
4  2024-01-05    225  North    John    22.5

In [20]:
# 3. Group the data by `Region` and calculate the total sales for each region.

In [27]:
byRegion = df.groupby('Region')['Sales'].sum()
print("Total sales in each region\n",'-'*55,sep='')
print(byRegion)

Total sales in each region
-------------------------------------------------------
Region
East     210
North    425
South    220
West     215
Name: Sales, dtype: int64

In [28]:
#4. Find the region with the highest average sales.

In [34]:
highest_region = df.groupby('Region')['Sales'].mean()
highest = highest_region.max()
print(highest)

220.0

Github loading and manipulation

In [40]:
#Load a CSV file from a GitHub repository into a pandas DataFrame.

In [4]:
import pandas as pd

In [6]:
df = pd.read_csv('/Users/satvinaik/Downloads/Titanic-Dataset.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
# 2. Display summary statistics of the DataFrame.

In [8]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [9]:
#3. Check for null values in the DataFrame and display the count of null values in each column.

In [10]:
nulls = df.isnull().sum()
print(nulls)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [11]:
# 4. Fill the null values in the 'Age' column with the mean age.

In [15]:
mean= df['Age'].mean()
df['Age'] = df['Age'].fillna(mean)

In [16]:
# 5. Drop the rows where 'Embarked' is null.

In [18]:
df_nonan=df.dropna(how='all')
df_nonan.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [19]:
# 6

In [22]:
df['FamilySize'] = df['SibSp'] + df['Parch']
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

In [21]:
# 7

In [26]:
df['Sex'] = df['Sex'].map({'male': 0, 'female': 1})

In [27]:
# 8

In [28]:
average_fare = df.groupby('Pclass')['Fare'].mean()
print(average_fare)

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

In [29]:
# 9

In [30]:
most_common_embarked = df['Embarked'].mode()[0]
print(f"The most common port of embarkation is: {most_common_embarked}")

The most common port of embarkation is: S

In [31]:
# 10

In [33]:
pivot = df.pivot_table(values='Survived', index='Sex', columns='Pclass', aggfunc='mean')